'''Вычислить количество цифр целого неотрицательного числа n.

Входные данные #1  = 12343

Выходные данные #1 = 5
'''

print(len(input()))